In [161]:
# Import needed libraries
import sys
sys.path.append(r'e:\Data science\Titanic dataset\notebooks')

from auto_imports import *


df = pd.read_csv('E:\Data science\Titanic dataset\data\Processed data\Data Analysis\cleaned data.csv')

### Feature engineering

In [162]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ind
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C23 C25 C27,S,train
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,train
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C23 C25 C27,S,train
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,train
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C23 C25 C27,S,train

split cabin column to cabin cell and cabin number

In [163]:
df['Cabin']

0       C23 C25 C27
1               C85
2       C23 C25 C27
3              C123
4       C23 C25 C27
           ...
1282    C23 C25 C27
1283           C105
1284    C23 C25 C27
1285    C23 C25 C27
1286    C23 C25 C27
Name: Cabin, Length: 1287, dtype: object

In [164]:
def remove_duplicate_letters(text):
        seen = set()
        result = ''
        for char in text:
            if char not in seen:
                seen.add(char)
                result += char
        return result.strip().replace(' ' , ',')

# splitting cabin column to cabin and cell number 
df['cell_number'] = df['Cabin'].replace(r'[a-zA-Z]' , '' , regex =True).str.replace(' ' , '-')
df['Cabin_letter'] = df['Cabin'].replace(r'[0-9]' , '' , regex = True).apply(remove_duplicate_letters)
# When removing digits from cabin column values output may be like that (B B B B) so I maked a function to remove this duplicted letters

In [165]:
df['Cabin_letter'].unique()

array(['C', 'E', 'G', 'D', 'A', 'B', 'F', 'F,G', 'F,E', 'T'], dtype=object)

In [166]:
df['cell_number'].unique()

array(['23-25-27', '85', '123', '46', '6', '103', '56', '78', '33', '30',
       '52', '83', '-73', '31', '5', '10-12', '26', '110', '58-60', '101',
       '-69', '47', '86', '2', '19', '7', '49', '4', '32', '80', '36',
       '15', '93', '35', '87', '77', '67', '94', '125', '99', '118', '',
       '22-26', '106', '65', '54', '57-59-63-66', '34', '18', '124', '91',
       '40', '128', '37', '50', '82', '96-98', '44', '104', '111', '92',
       '38', '21', '12', '63', '14', '20', '79', '25', '73', '95', '39',
       '22', '70', '16', '68', '10', '41', '9', '23', '48', '58', '126',
       '71', '51-53-55', '-63', '62-64', '24', '90', '45', '8', '121',
       '11', '3', '82-84', '17', '102', '69', '28', '42', '148', '61',
       '53', '43', '130', '132', '55-57', '116', '29', '51', '97', '89',
       '-46', '-57', '60', '39-41', '52-54-56', '105'], dtype=object)

In [167]:
df.drop('Cabin' , axis =1 , inplace=True)

In [168]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,ind,cell_number,Cabin_letter
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,train,23-25-27,C
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,train,85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,train,23-25-27,C
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,train,123,C
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,train,23-25-27,C

I want to extract some important information from name column. Then I will drop it

In [169]:
df['Name'][0]

'Braund, Mr. Owen Harris'

- I will extract family name from the first word and title from the second word 
> Last thing I want to see names have a brackets. What do brackets refer to?

Now let's titles

In [170]:
df['Name'].str.split(r'[,.]').str[1].str.strip().value_counts()

Name
Mr              739
Miss            259
Mrs             196
Master           60
Rev               8
Dr                8
Col               4
Major             2
Ms                2
Mlle              2
Don               1
Mme               1
Lady              1
Capt              1
the Countess      1
Jonkheer          1
Dona              1
Name: count, dtype: int64

In [171]:
df['Title'] = df['Name'].str.split(r'[,.]').str[1].str.strip()

In [172]:
mask = df['Name'].str.contains(r'\((.*?)\)')

In [173]:
non_brackets = df.loc[~mask]
non_brackets['FamilyName'] =non_brackets['Name'].str.split(',').str[0].str.strip()

In [174]:
brackets = df.loc[mask]
brackets.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,ind,cell_number,Cabin_letter,Title
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,train,85,C,Mrs
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,train,123,C,Mrs
8,9,1.0,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,S,train,23-25-27,C,Mrs
9,10,1.0,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,C,train,23-25-27,C,Mrs
15,16,1.0,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,S,train,23-25-27,C,Mrs

In [175]:
# Extract the text inside brackets, split by space, and get the last word for each row
brackets['FamilyName'] = brackets['Name'].str.extract(r'\((.*?)\)')[0].str.split().str[-1]

In [176]:
# combain them in comlumn called family name
df = pd.concat([non_brackets , brackets]).sort_values(by='PassengerId')
df.drop('Name' , axis = 1 , inplace=True)

In [177]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,ind,cell_number,Cabin_letter,Title,FamilyName
0,1,0.0,3,male,22.0,1,0,A/5 21171,7.2500,S,train,23-25-27,C,Mr,Braund
1,2,1.0,1,female,38.0,1,0,PC 17599,71.2833,C,train,85,C,Mrs,Thayer
2,3,1.0,3,female,26.0,0,0,STON/O2. 3101282,7.9250,S,train,23-25-27,C,Miss,Heikkinen
3,4,1.0,1,female,35.0,1,0,113803,53.1000,S,train,123,C,Mrs,Peel
4,5,0.0,3,male,35.0,0,0,373450,8.0500,S,train,23-25-27,C,Mr,Allen

Now let's extract some important information from ticket column like 

1. route/agent
2. batch/timeframe
3. SharedTicket(1 , 0)

In [178]:
df['Ticket'].str.split()

0                [A/5, 21171]
1                 [PC, 17599]
2         [STON/O2., 3101282]
3                    [113803]
4                    [373450]
                ...
1282             [A.5., 3236]
1283              [PC, 17758]
1284    [SOTON/O.Q., 3101262]
1285                 [359309]
1286                   [2668]
Name: Ticket, Length: 1287, dtype: object

In [179]:
# I want to update only_character variable
clean_agents = df['Ticket'].str.extract(r'^([A-Za-z/.]+\d*)', expand=False).fillna('Non-special').replace('[.]' , '' , regex=True)

In [180]:
clean_agents.unique()

# That's perfect

array(['A/5', 'PC', 'STON/O2', 'Non-special', 'PP', 'CA', 'SC/Paris',
       'SC/A4', 'A/4', 'SP', 'SOC', 'SO/C', 'W/C', 'SOTON/OQ', 'WEP',
       'STON/O', 'A4', 'C', 'SC/PARIS', 'SOP', 'A5', 'Fa', 'LINE', 'FCC',
       'SW/PP', 'SCO/W', 'P/PP', 'SC', 'SC/AH', 'A/S', 'WE/P', 'SO/PP',
       'FC', 'SOTON/O2', 'CA/SOTON', 'SC/A3', 'STON/OQ', 'AQ/4', 'A',
       'LP', 'AQ/3'], dtype=object)

In [181]:
df['Special Agent/route'] = clean_agents

Make Ticket batch column

In [182]:
ticket_digits = df['Ticket'].str.split().str[-1]
ticket_digits.str.len().unique()

array([5, 7, 6, 4, 3, 1])

In [183]:
ticket_digits[ticket_digits.str.len() == 1]

758     3
825     3
1058    2
1173    2
Name: Ticket, dtype: object

In [184]:
corrected_values = df.iloc[ticket_digits[ticket_digits.str.len() == 1].index]['Ticket'].values
corrected_values

array(['S.O./P.P. 3', 'S.O./P.P. 3', 'S.O./P.P. 2', 'S.O./P.P. 2'],
      dtype=object)

In [185]:
ticket_digits[ticket_digits.str.len() == 1] = corrected_values

In [186]:
ticket_digits.str.len().unique()

array([ 5,  7,  6,  4,  3, 11])

In [187]:
ticket_digits.unique()

array(['21171', '17599', '3101282', '113803', '373450', '330877', '17463',
       '349909', '347742', '237736', '9549', '113783', '2151', '347082',
       '350406', '248706', '382652', '244373', '345763', '2649', '239865',
       '248698', '330923', '113788', '347077', '2631', '19950', '330959',
       '349216', '17601', '17569', '335677', '24579', '17604', '113789',
       '2677', '2152', '345764', '2651', '7546', '11668', '349253',
       '2123', '330958', '23567', '370371', '14311', '2662', '349237',
       '3101295', '39886', '17572', '2926', '113509', '19947', '31026',
       '2697', '34651', '2144', '2669', '36973', '347088', '17605',
       '2661', '29395', '3464', '3101281', '315151', '33111', '14879',
       '2680', '1601', '348123', '349208', '374746', '248738', '364516',
       '345767', '345779', '330932', '113059', '14885', '3101278', '6608',
       '392086', '343275', '343276', '347466', '5734', '2315', '364500',
       '374910', '17754', '17759', '231919', '244367', '349245', '35281',
       '7540', '3101276', '349207', '343120', '312991', '349249',
       '371110', '110465', '2665', '324669', '4136', '2627', '3101294',
       '370369', '17558', '54510', '27267', '370372', '17369', '2668',
       '347061', '349241', '3101307', '3337', '228414', '29178', '2133',
       '11752', '7534', '17593', '2678', '347081', '3101279', '365222',
       '231945', '33112', '244310', '1166', '113776', '11206', '851',
       '265302', '17597', '35851', '392090', '315037', '2343', '371362',
       '33595', '347068', '315093', '363291', '113505', '17318', '111240',
       '3101280', '17764', '350404', '4133', '17595', '250653', 'LINE',
       '2131', '230136', '315153', '113767', '370365', '364849', '349247',
       '234604', '28424', '350046', '230080', '17610', '368703', '4579',
       '370370', '248747', '345770', '3101264', '2628', '3540', '347054',
       '2699', '367231', '112277', '3101311', '13528', '21174', '250646',
       '367229', '35273', '3101283', '243847', '11813', '14208', '392089',
       '220367', '21440', '349234', '19943', '4348', '751', '236171',
       '347067', '237442', '29566', '6609', '26707', '31921', '28665',
       '1585', '367230', '14263', '3101275', '2694', '19928', '347071',
       '250649', '11751', '244252', '362316', '113514', '3336', '370129',
       '2650', '17585', '110152', '17755', '230433', '384461', '110413',
       '112059', '382649', '17248', '347083', '17582', '17760', '113798',
       '250644', '17596', '370375', '13502', '347073', '239853', '2673',
       '336439', '347464', '345778', '10482', '113056', '349239',
       '345774', '349206', '237798', '370373', '19877', '11967', '2163',
       '349236', '349233', '17612', '2693', '113781', '19988', '9234',
       '367226', '226593', '2466', '17421', '17758', '3381', '17485',
       '11767', '17608', '250651', '349243', '13529', '347470', '29011',
       '36928', '16966', '21172', '349219', '234818', '345364', '28551',
       '111361', '113043', '17611', '349225', '7598', '113784', '248740',
       '244361', '229236', '248733', '31418', '386525', '37671', '315088',
       '7267', '113510', '2695', '2647', '345783', '237671', '330931',
       '330980', '2167', '2691', '3101310', '7076', '110813', '2626',
       '14313', '17477', '11765', '3101267', '323951', '7077', '113503',
       '2648', '347069', '17757', '2653', '3101293', '349227', '27849',
       '367655', '1748', '113760', '350034', '3101277', '350052',
       '350407', '28403', '244278', '240929', '3101289', '341826', '4137',
       '315096', '28664', '347064', '29106', '312992', '349222', '394140',
       '3101269', '343095', '28220', '250652', '28228', '345773',
       '349254', '13032', '315082', '347080', '34244', '2003', '250655',
       '364851', '110564', '376564', '3085', '3101274', '13507', '18723',
       '345769', '347076', '230434', '65306', '33638', '113794', '2666',
       '113786', '65303', '113051', '17453', '2817', '349240', '13509',
       '17464', '13531', '371060', '19952', '364506', '111320', '234360',
       '2816', '3101306', '113792', '36209', '323592', '315089', '541',
       '7553', '31027', '3460', '350060', '3101298', '239854', '3594',
       '4134', '11771', '18509', '65304', '3101317', '113787', '17609',
       '45380', '36947', '6212', '350035', '315086', '364846', '330909',
       '4135', '26360', '4001', '382651', '3101316', '17473', '17603',
       '349209', '36967', '34260', '226875', '349242', '12749', '349252',
       '2624', '2700', '367232', '14258', '17483', '3101296', '29104',
       '2641', '2690', '315084', '113050', '17761', '364498', '13568',
       '5735', '2908', '693', '2146', '244358', '330979', '347085',
       '113807', '11755', '345572', '372622', '349251', '218629',
       '392082', '392087', '48871', '349205', '2686', '350417', '752',
       '11769', '14312', '20589', '358585', '243880', '2689', '3101286',
       '237789', '13049', '3411', '237565', '13567', '14973', '3235',
       '3101273', '3902', '364848', '29037', '248727', '2664', '349214',
       '113796', '364511', '349910', '349246', '113804', '3101305',
       '370377', '364512', '220845', '31028', '2659', '11753', '350029',
       '54636', '36963', '219533', '349224', '334912', '27042', '347743',
       '13214', '112052', '237668', '3101292', '350050', '349231',
       '13213', '2314', '349221', '8475', '330919', '365226', '349223',
       '29751', '2623', '5727', '349210', '3101285', '234686', '312993',
       '3536', '19996', '29750', '12750', '24580', '244270', '239856',
       '349912', '342826', '4138', '330935', '6563', '349228', '350036',
       '24160', '17474', '349256', '2672', '113800', '248731', '363592',
       '35852', '348121', '17475', '36864', '350025', '223596', '17476',
       '17482', '113028', '7545', '250647', '348124', '34218', '36568',
       '347062', '350048', '12233', '250643', '113806', '315094', '36866',
       '236853', '3101271', '239855', '28425', '233639', '349201',
       '349218', '16988', '376566', '3101288', '250648', '113773',
       '335097', '29103', '392096', '345780', '349204', '350042', '29108',
       '363294', '3101272', '2663', '347074', '112379', '364850', '8471',
       '345781', '350047', 'S.O./P.P. 3', '2674', '29105', '347078',
       '383121', '36865', '2687', '113501', '6607', '3101312', '3101265',
       '12460', '17600', '349203', '28213', '17465', '349244', '2685',
       '2625', '347089', '347063', '112050', '347087', '248723', '3474',
       '28206', '364499', '112058', '3101290', '2079', '7075', '315098',
       '19972', '368323', '367228', '2671', '347468', '2223', '17756',
       '315097', '392092', '11774', '3101287', '2683', '315090', '5547',
       '349213', '347060', '17592', '392091', '113055', '2629', '350026',
       '28134', '17466', '233866', '236852', '2149', '17590', '345777',
       '349248', '695', '345765', '2667', '349212', '349217', '349257',
       '7552', '34068', '392076', '211536', '112053', '111369', '370376',
       '330911', '363272', '240276', '315154', '7538', '330972', '2657',
       '349220', '694', '21228', '24065', '233734', '2692', '3101270',
       '2696', '17368', '17598', '2698', '113054', '31029', '13236',
       '342712', '315087', '345768', '113778', '3101263', '237249',
       '3101291', '17594', '370374', '13695', '2168', '2861', '349230',
       '348122', '349232', '237216', '347090', '334914', '13534',
       '330963', '2543', '382653', '349211', '3101297', '17562', '359306',
       '11770', '248744', '368702', '19924', '349238', '240261', '2660',
       '330844', '31416', '364856', '347072', '345498', '376563', '13905',
       '350033', '3101268', '347471', '3338', '11778', '365235', '347070',
       '330920', '383162', '248734', '237734', '330968', '17531',
       '329944', '2681', '13050', '367227', '392095', '368783', '350045',
       '211535', '342441', '369943', '113780', '2621', '349226', '350409',
       '2656', '248659', '392083', '23568', '113791', '349255', '3701',
       '350405', '347469', '110489', '3101315', '335432', '220844',
       '343271', '237393', '17591', '17770', '7548', '251', '2670',
       '233478', '7935', '239059', 'S.O./P.P. 2', '48873', '28221',
       '111163', '235509', '347465', '347066', '31030', '65305', '34050',
       '12998', '9232', '28034', '17613', '349250', '3101308', '347091',
       '113038', '330924', '32302', '2148', '342684', '14266', '350053',
       '17606', '350054', '370368', '242963', '113795', '3101266',
       '330971', '350416', '2679', '250650', '112377', '3470', '3101284',
       '13508', '7266', '345775', '42795', '3130', '363611', '28404',
       '345501', '350410', '34644', '349235', '112051', '49867', '39186',
       '315095', '368573', '2676', '14888', '31352', '14260', '315085',
       '364859', '21175', '2655', '1478', '17607', '382650', '2652',
       '345771', '349202', '113801', '347467', '347079', '237735',
       '315092', '383123', '112901', '315091', '2658', '1588', '368364',
       '30631', '28004', '350408', '347075', '2654', '244368', '113790',
       '3101309', '236854', '17580', '2684', '349229', '110469', '244360',
       '2675', '2622', '15185', '350403', '348125', '237670', '2688',
       '248726', '13540', '113044', '1222', '368402', '315083', '112378',
       '2147', '28133', '248746', '315152', '29107', '680', '366713',
       '330910', '2159', '349911', '244346', '364858', '30769', '371109',
       '347065', '21332', '17765', '28666', '334915', '365237', '347086',
       '3236', '3101262', '359309'], dtype=object)

In [188]:
df['TicketBatch'] = np.where(ticket_digits.str.len() < 5 , 1,0)

1: Early<br>
0: Late

Let's make boolean column called shared ticket

In [189]:
df['SharedTicket'] = np.where(df['Ticket'].duplicated() , 1 , 0)

In [190]:
first_digit_ticket = df['Ticket'].str.extract(r'([0-9]+)')[0]
first_digit_ticket

0             5
1         17599
2             2
3        113803
4        373450
         ...
1282          5
1283      17758
1284    3101262
1285     359309
1286       2668
Name: 0, Length: 1287, dtype: object

In [191]:
df['Ticket'].head()

0           A/5 21171
1            PC 17599
2    STON/O2. 3101282
3              113803
4              373450
Name: Ticket, dtype: object

In [192]:
df.drop('Ticket' , axis = 1 , inplace=True)

In [193]:
df.sample(10)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,ind,cell_number,Cabin_letter,Title,FamilyName,Special Agent/route,TicketBatch,SharedTicket
290,297,0.0,3,male,23.500000,0,0,7.2292,C,train,23-25-27,C,Mr,Hanna,Non-special,1,0
984,1003,NaN,3,female,29.881138,0,0,7.7792,Q,test,23-25-27,C,Miss,Shine,Non-special,0,0
559,569,0.0,3,male,29.881138,0,0,7.2292,C,train,23-25-27,C,Mr,Doharr,Non-special,1,0
585,596,0.0,3,male,36.000000,1,1,24.1500,S,train,23-25-27,C,Mr,Van Impe,Non-special,0,1
40,41,0.0,3,female,40.000000,1,0,9.4750,S,train,23-25-27,C,Mrs,Larsson,Non-special,1,0
537,546,0.0,1,male,64.000000,0,0,26.0000,S,train,23-25-27,C,Mr,Nicholson,Non-special,1,0
1103,1123,NaN,1,female,21.000000,0,0,26.5500,S,test,23-25-27,C,Miss,Willard,Non-special,0,0
397,404,0.0,3,male,28.000000,1,0,15.8500,S,train,23-25-27,C,Mr,Hakkarainen,STON/O2,0,1
153,158,0.0,3,male,30.000000,0,0,8.0500,S,train,23-25-27,C,Mr,Corn,SOTON/OQ,0,0
1030,1050,NaN,1,male,42.000000,0,0,26.5500,S,test,22,D,Mr,Borebank,Non-special,0,0

In [194]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1287 entries, 0 to 1286
Data columns (total 17 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   PassengerId          1287 non-null   int64
 1   Survived             875 non-null    float64
 2   Pclass               1287 non-null   int64
 3   Sex                  1287 non-null   object
 4   Age                  1287 non-null   float64
 5   SibSp                1287 non-null   int64
 6   Parch                1287 non-null   int64
 7   Fare                 1286 non-null   float64
 8   Embarked             1287 non-null   object
 9   ind                  1287 non-null   object
 10  cell_number          1287 non-null   object
 11  Cabin_letter         1287 non-null   object
 12  Title                1287 non-null   object
 13  FamilyName           1287 non-null   object
 14  Special Agent/route  1287 non-null   object
 15  TicketBatch          1287 non-null   int64
 16  SharedTicket         1287 non-null   int64
dtypes: float64(3), int64(6), object(8)
memory usage: 181.0+ KB

In [195]:
# saving them 
df.to_csv('E:\Data science\Titanic dataset\data\Processed data\Data Analysis\processed_data.csv' , index=False)